{
    "response": "OK. Let's get Interesting story about Newton.Welcome to Interesting story about Newton: Did you know that Sir Isaac Newton PRS was an English mathematician, physicist, astronomer, theologian, and author who is widely recognised as one of the most influential scientists of all time and as a key figure in the scientific revolution.",
    "expectUserResponse": false,
    "conversationToken": "EosDS2o5Wm...",
    "audioResponse": "//NExAARgD...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "OK. Let's get Interesting story about Newton."
                }
            },
            {
                "displayText": {
                    "content": "Welcome to Interesting story about Newton: Did you know that Sir Isaac Newton PRS was an English mathematician, physicist, astronomer, theologian, and author who is widely recognised as one of the most influential scientists of all time and as a key figure in the scientific revolution."
                }
            },
            {
                "basicCard": {
                    "title": "Isaac Newton",
                    "subtitle": "Mathematician",
                    "formattedText": "Who Was Isaac Newton?\nIsaac Newton was a physicist and mathematician who developed the principles of modern physics, including the laws of motion and is credited as one of the great minds of the 17th-century Scientific Revolution. \n\nIn 1687, he published his most acclaimed work, Philosophiae Naturalis Principia Mathematica (Mathematical Principles of Natural Philosophy), which has been called the single most influential book on physics. In 1705, he was knighted by Queen Anne of England, making him Sir Isaac Newton. \n\nEarly Life and Family\nNewton was born on January 4, 1643, in Woolsthorpe, Lincolnshire, England. Using the \"old\" Julian calendar, Newton's birth date is sometimes displayed as December 25, 1642.\n\nNewton was the only son of a prosperous local farmer, also named Isaac, who died three months before he was born. A premature baby born tiny and weak, Newton was not expected to survive.\n\nWhen he was 3 years old, his mother, Hannah Ayscough Newton, remarried a well-to-do minister, Barnabas Smith, and went to live with him, leaving young Newton with his maternal grandmother. \n\nThe experience left an indelible imprint on Newton, later manifesting itself as an acute sense of insecurity. He anxiously obsessed over his published work, defending its merits with irrational behavior.\n\nAt age 12, Newton was reunited with his mother after her second husband died. She brought along her three small children from her second marriage.\n\nIsaac Newton's Education\nNewton was enrolled at the King's School in Grantham, a town in Lincolnshire, where he lodged with a local apothecary and was introduced to the fascinating world of chemistry.\n\nHis mother pulled him out of school at age 12. Her plan was to make him a farmer and have him tend the farm. Newton failed miserably, as he found farming monotonous. Newton was soon sent back to King's School to finish his basic education.\n\nPerhaps sensing the young man's innate intellectual abilities, his uncle, a graduate of the University of Cambridge's Trinity College, persuaded Newton's mother to have him enter the university. Newton enrolled in a program similar to a work-study in 1661, and subsequently waited on tables and took care of wealthier students' rooms.\n\nScientific Revolution\nWhen Newton arrived at Cambridge, the Scientific Revolution of the 17th century was already in full force. The heliocentric view of the universe—theorized by astronomers Nicolaus Copernicus and Johannes Kepler, and later refined by Galileo—was well known in most European academic circles.\n\nPhilosopher René Descartes had begun to formulate a new concept of nature as an intricate, impersonal and inert machine. Yet, like most universities in Europe, Cambridge was steeped in Aristotelian philosophy and a view of nature resting on a geocentric view of the universe, dealing with nature in qualitative rather than quantitative terms.\n\nDuring his first three years at Cambridge, Newton was taught the standard curriculum but was fascinated with the more advanced science. All his spare time was spent reading from the modern philosophers. The result was a less-than-stellar performance, but one that is understandable, given his dual course of study.\n\nIt was during this time that Newton kept a second set of notes, entitled \"Quaestiones Quaedam Philosophicae\" (\"Certain Philosophical Questions\"). The \"Quaestiones\" reveal that Newton had discovered the new concept of nature that provided the framework for the Scientific Revolution. Though Newton graduated without honors or distinctions, his efforts won him the title of scholar and four years of financial support for future education.\n\nIn 1665, the bubonic plague that was ravaging Europe had come to Cambridge, forcing the university to close. After a two-year hiatus, Newton returned to Cambridge in 1667 and was elected a minor fellow at Trinity College, as he was still not considered a standout scholar.\n\nIn the ensuing years, his fortune improved. Newton received his Master of Arts degree in 1669, before he was 27. During this time, he came across Nicholas Mercator's published book on methods for dealing with infinite series. \n\nNewton quickly wrote a treatise, De Analysi, expounding his own wider-ranging results. He shared this with friend and mentor Isaac Barrow, but didn't include his name as author.\n\nIn June 1669, Barrow shared the unaccredited manuscript with British mathematician John Collins. In August 1669, Barrow identified its author to Collins as \"Mr. Newton ... very young ... but of an extraordinary genius and proficiency in these things.\" \n\nNewton's work was brought to the attention of the mathematics community for the first time. Shortly afterward, Barrow resigned his Lucasian professorship at Cambridge, and Newton assumed the chair.\n\nIsaac Newton’s Discoveries\nNewton made discoveries in optics, motion and mathematics. Newton theorized that white light was a composite of all colors of the spectrum, and that light was composed of particles. \n\nHis momentous book on physics, Principia, contains information on nearly all of the essential concepts of physics except energy, ultimately helping him to explain the laws of motion and the theory of gravity. Along with mathematician Gottfried Wilhelm von Leibniz, Newton is credited for developing essential theories of calculus. \n\nIsaac Newton Inventions\nNewton's first major public scientific achievement was designing and constructing a reflecting telescope in 1668. As a professor at Cambridge, Newton was required to deliver an annual course of lectures and chose optics as his initial topic. He used his telescope to study optics and help prove his theory of light and color. \n\nThe Royal Society asked for a demonstration of his reflecting telescope in 1671, and the organization's interest encouraged Newton to publish his notes on light, optics and color in 1672. These notes were later published as part of Newton's Opticks: Or, A treatise of the Reflections, Refractions, Inflections and Colours of Light.",
                    "image": {
                        "url": "https://www.laphamsquarterly.org/sites/default/files/styles/tall_rectangle_custom_user_small_2x/public/images/contributor/newton_360x450.jpg?itok=TCxDFFMB&timestamp=1409690753",
                        "accessibilityText": "Isaac Newton",
                        "height": 0,
                        "width": 0
                    },
                    "buttonsList": [
                        {
                            "title": "Know more about him...",
                            "openUrlAction": {
                                "url": "https://www.newton.ac.uk/about/isaac-newton/life",
                                "urlTypeHint": 0
                            }
                        }
                    ],
                    "imageDisplayOptions": 0
                }
            }
        ],
        "suggestionsList": [],
        "agentLogoUrl": "https://lh3.googleusercontent.com/_vctaG4pPkR-0W8CL6HIPGTmmAmLnoA19c1B-HE4xOAXftifeRc-_4DlTrmnr_mCYi5-zrfNxAg",
        "agentStyle": {
            "primaryColor": "",
            "fontFamily": "",
            "borderRadius": 0
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 4,
            "startIndicatorPayLoad": {
                "status": 1
            }
        },
        {
            "operationType": 7,
            "exitIndicatorPayLoad": {
                "status": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "Interesting story about Newton",
    "servingModelOutdated": false,
    "request": "Talk to Interesting story about Newton"
}