{
    "2": {
        "req": "Ask My University Park to read me the news",
        "res": "OK. Here's My University Park.News 2021 Park Cities Independence Day Parade This year's parade will be held on Saturday, July 3.  The parade will start at Highland Park Town Hall at 9 a.m. and proceed north on Preston Road to University Boulevard, heading east until ending in Goar Park.  This year’s parade theme is United We Stand.  The parade is dedicated to frontline City and Town staff members and all area healthcare providers who tirelessly served the Park Cities during February’s winter storm and COVID-19.\n \nFor more information about the parade go to the Rotary Club of the Park Cities website .  Parade Route Map Inclement Weather Policy\n  Post-Parade Event in Goar Park\n \nAs the parade winds down, join us for some post-parade fun in Goar Park!  Activities will end by 1 p.m.   \n  Outdoor Movie -  National Treasure Fun Zone with bungee jump and rock climbing wall “Silent Party” outdoor concert E-sports gaming tournament Southern Methodist University football players will be signing autographs and participating in E-sports tournament\nThank you to our sponsors of the Post-Parade Celebration! Enroll in University Park Police Department’s Citizens’ Police Academy The inaugural class of the University Park Police Department’s Citizens’ Police Academy is forming now!\nThis community-based, educational program is designed to provide University Park residents, who are at least 21 years old, with a working knowledge of the department, its personnel, and its policies. Dates and Details\nAcademy presentations will consist of 12 sessions held on Thursday nights from September 2 through November 18. All sessions will begin at 6:30 p.m. To enhance learning and discussion, class size will be capped, and all class members will be expected to attend regularly.      \n  \nEach Thursday you will receive classroom and “hands-on” instruction from officers or supervisors who work in the divisions being highlighted. Facility tours and the opportunity to “ride along” with a University Park police officer are also part of the program. \nOur primary objective in offering the Academy program is to strengthen and expand our partnerships with the community. Working together, we can make University Park an even safer place to live and work.\nFor more information and to receive an application, please email Assistant Chief John Ball at jball@ up texas.org .",
        "QType": "START",
        "Q_id": 1,
        "over": false,
        "canvas": false,
        "id": 2,
        "req_list": [
            "Ask My University Park to read me the news"
        ],
        "candidates": {},
        "parent": 1
    }
}