{
    "response": "Welcome to Mary's Domain! At Sharples Dining Hall Lunch (from 11:30am to 12:30pm) Dinner (from 4:30pm to 5:30pm) At Essie Mae's Essie's open (from 8:00am to 2:00pm) We are here to serve you Breakfast and Lunch . We aslo have a wide variety of snacks and beverages too. Deli Lunch Special: Fried Chicken Cobb Salad- Romaine, Cherry tomato, Avocado, red onion, hard boiled egg, Fried chicken, Chipotle ranch dressing served with a piece of fruit and a choice of drink. We are now offering limited seating in our dining area. The seating that is not available to you is clearly marked. We ask that you adhere to our physical distancing policies in consideration and well being of our community. We ask you to not remain seated longer than 40 minutes so that our other customers have an opportunity to sit down and enjoy their meal. Thankyou for your cooperation. At Science Center coffee bar Science center café open (from 8:00am to 1:00pm) We are open and serving a selection of hot beverages, sandwiches, salads, snacks and cold beverages.. You can ask me for the lunch or dinner menu, or what's on tomorrow or at Essie Mae's.",
    "expectUserResponse": true,
    "conversationToken": "EosDS2o5Uk...",
    "audioResponse": "//NExAAQaJ...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "Welcome to Mary's Domain! How may I help you?"
                }
            },
            {
                "basicCard": {
                    "title": "Menu",
                    "subtitle": "",
                    "formattedText": "At Sharples Dining Hall\nLunch (11:30–12:30)\n\nDinner (16:30–17:30)\n\n\nAt Essie Mae's\nEssie's Open  (08:00–14:00)\nWe are here to serve you Breakfast and Lunch . We aslo have a wide variety of snacks and beverages too.\nDeli Lunch Special: \nFried Chicken Cobb Salad- Romaine, Cherry tomato, Avocado, red onion, hard boiled egg, Fried chicken, Chipotle ranch dressing served with a piece of fruit and a choice of drink. \nWe are now offering limited seating in our dining area. \nThe seating that is not available to you is clearly marked. We ask that you adhere to our physical distancing policies in consideration and well being of our community. \nWe ask you to not remain seated longer than 40 minutes so that our other customers have an opportunity to sit down and enjoy their meal. \nThankyou for your cooperation.\n\nAt Science Center coffee bar\nScience Center café Open   (08:00–13:00)\nWe are open and serving a selection of hot beverages, sandwiches, salads, snacks and cold beverages.\n\n",
                    "buttonsList": [],
                    "imageDisplayOptions": 0
                }
            }
        ],
        "suggestionsList": [
            {
                "title": "What's for lunch?"
            },
            {
                "title": "What's for dinner?"
            },
            {
                "title": "What's at Essie Mae's?"
            },
            {
                "title": "What's on tomorrow?"
            }
        ],
        "agentLogoUrl": "https://lh3.googleusercontent.com/n_GgzQ_Y6h5DQTONeB1AbMawHIV12QGQeRick_NuL_zgc7ZZHFCCA7aea7A3p4szY3C4vgMzlD_t",
        "agentStyle": {
            "primaryColor": "",
            "fontFamily": "",
            "borderRadius": 0
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 4,
            "startIndicatorPayLoad": {
                "status": 1
            }
        },
        {
            "operationType": 8,
            "showSuggestionsPayLoad": {
                "textsList": [
                    "What's for lunch?",
                    "What's for dinner?",
                    "What's at Essie Mae's?",
                    "What's on tomorrow?"
                ]
            }
        },
        {
            "operationType": 1,
            "micUpdatePayLoad": {
                "micMode": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "Mary's Domain",
    "servingModelOutdated": false,
    "request": "Talk to Mary's Domain"
}