{
    "response": "I found Chip and asked him if he'd like to help me surprise the Beast with a ladder. Chip grinned, and said he'd like that a lot, but he wondered where we should start. \"Right here,\" I said and pulled a big book about woodworking off of a shelf. I explained that with so many books, I knew we could learn to fix a lot of things. According to the woodworking book, we needed lumber, a saw, a hammer, and some nails to build a ladder. Luckily, there was plenty of wood and a box of tools in the barn. I changed into a work dress. Then, with Chip's help, I measured and sawed and nailed until we had built a ladder that was even sturdier and taller than the last one. \"Just wait till the Beast sees this!\" I exclaimed. We showed it to the Beast. He was surprised and pleased, but he still seemed a little grumpy. Everyone else was very happy, though. Lumiere, Cogsworth, and Mrs. Potts all marveled at our ladder. Cogsworth even declared it, \"excellent craftsmanship!\"\nI hope you've enjoyed the story so far. Would you like to hear the next part?",
    "expectUserResponse": true,
    "conversationToken": "ErMDS2s1Rk...",
    "audioResponse": "SUQzBAAAAA...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "I found Chip and asked him if he'd like to help me surprise the Beast with a ladder. Chip grinned, and said he'd like that a lot, but he wondered where we should start. \"Right here,\" I said and pulled a big book about woodworking off of a shelf. I explained that with so many books, I knew we could learn to fix a lot of things. According to the woodworking book, we needed lumber, a saw, a hammer, and some nails to build a ladder. Luckily, there was plenty of wood and a box of tools in the barn. I changed into a work dress. Then, with Chip's help, I measured and sawed and nailed until we had built a ladder that was even sturdier and…"
                }
            },
            {
                "displayText": {
                    "content": "I hope you've enjoyed the story so far. Would you like to hear the next part?"
                }
            }
        ],
        "suggestionsList": [
            {
                "title": "Yes"
            },
            {
                "title": "No"
            }
        ],
        "agentLogoUrl": "https://lh3.googleusercontent.com/HNbbYhdNrGKtHaG_vr93xjprs4RQtVqvaX2xHkmxGhDrxX2LmpTiTmoU3VhGTzHByzXm1m8L3Y1U1w",
        "agentStyle": {
            "primaryColor": "#101010",
            "fontFamily": "",
            "borderRadius": 0,
            "backgroundImageUrl": "https://lh3.googleusercontent.com/3KrCYREWgBxduAGRxWRbZPPXwVVwu3YtA1nBjbiwbJs-e98Ql-tXqw31jxzbKZmt4Jn4bLlrLe4N9Q"
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 8,
            "showSuggestionsPayLoad": {
                "textsList": [
                    "Yes",
                    "No"
                ]
            }
        },
        {
            "operationType": 1,
            "micUpdatePayLoad": {
                "micMode": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "Disney Princess",
    "servingModelOutdated": false,
    "request": "Yes"
}