{
    "response": "Wonderful! We'll go straight to the library and I'll tell you the story of how I used my love of reading to fix things around the castle.\nHere we are. Back in the library. Let's get comfy and I'll begin the story...\nOne day, the Beast saw me struggling on the library ladder to reach a book, and offered to get it for me. The Beast climbed up. He had almost reached the book, when suddenly we heard a sharp C-R-R-RACK! The Beast was too heavy for the ladder. It had broken apart! With a thump, he landed on the floor. I asked him if he was alright, as I knelt by his side, but the Beast just grumbled. He was fine, but the splintered ladder was useless now. I assured him that we could build a new one, but he snapped back that it would be impossible. He knew his hands were too big and clumsy to handle most tools. The Beast told me to leave it, and stormed off. But I wasn't used to leaving things broken. My father was an inventor, and I was sure I could figure out a way to build a new ladder.\nI hope you've enjoyed the story so far. Would you like to hear the next part?",
    "expectUserResponse": true,
    "conversationToken": "ErMDS2s1Rk...",
    "audioResponse": "SUQzBAAAAA...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "Wonderful! We'll go straight to the library and I'll tell you the story of how I used my love of reading to fix things around the castle. Here we are. Back in the library. Let's get comfy and I'll begin the story... One day, the Beast saw me struggling on the library ladder to reach a book, and offered to get it for me. The Beast climbed up. He had almost reached the book, when suddenly we heard a sharp C-R-R-RACK! The Beast was too heavy for the ladder. It had broken apart! With a thump, he landed on the floor. I asked him if he was alright, as I knelt by his side, but the Beast just grumbled. He was fine, but the splintered ladder…"
                }
            },
            {
                "displayText": {
                    "content": "I hope you've enjoyed the story so far. Would you like to hear the next part?"
                }
            }
        ],
        "suggestionsList": [
            {
                "title": "Yes"
            },
            {
                "title": "No"
            }
        ],
        "agentLogoUrl": "https://lh3.googleusercontent.com/HNbbYhdNrGKtHaG_vr93xjprs4RQtVqvaX2xHkmxGhDrxX2LmpTiTmoU3VhGTzHByzXm1m8L3Y1U1w",
        "agentStyle": {
            "primaryColor": "#101010",
            "fontFamily": "",
            "borderRadius": 0,
            "backgroundImageUrl": "https://lh3.googleusercontent.com/3KrCYREWgBxduAGRxWRbZPPXwVVwu3YtA1nBjbiwbJs-e98Ql-tXqw31jxzbKZmt4Jn4bLlrLe4N9Q"
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 8,
            "showSuggestionsPayLoad": {
                "textsList": [
                    "Yes",
                    "No"
                ]
            }
        },
        {
            "operationType": 1,
            "micUpdatePayLoad": {
                "micMode": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "Disney Princess",
    "servingModelOutdated": false,
    "request": "Yes"
}