{
    "response": "Next came the chimney. According to the book I found, the smokestack needed to be swept clean. But that meant climbing on the roof. Lumiere called to me to be careful, but I told him not to worry, as I was doing everything by the book. I used a brush to sweep the chimney until I had removed every bit of soot. Once the chimney was clean, I went to fix the leaky faucet. I opened the repair book to the chapter on plumbing, which said to tighten the pipe with a wrench. I twisted the wrench as hard as I could, but the joint wouldn't budge. Then I heard a cough behind me. It was the Beast. He offered to give it a try. I smiled gratefully and handed him the wrench. With one mighty twist, the Beast fixed the leak. Mrs. Potts was very grateful that we'd stopped the drip. She made some tea to celebrate. I blushed as Lumiere thanked me for my hard work, and Chip added that we should thank the books, too.\nI hope you've enjoyed the story so far. Would you like to hear the next part?",
    "expectUserResponse": true,
    "conversationToken": "ErMDS2s1Rk...",
    "audioResponse": "SUQzBAAAAA...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "Next came the chimney. According to the book I found, the smokestack needed to be swept clean. But that meant climbing on the roof. Lumiere called to me to be careful, but I told him not to worry, as I was doing everything by the book. I used a brush to sweep the chimney until I had removed every bit of soot. Once the chimney was clean, I went to fix the leaky faucet. I opened the repair book to the chapter on plumbing, which said to tighten the pipe with a wrench. I twisted the wrench as hard as I could, but the joint wouldn't budge. Then I heard a cough behind me. It was the Beast. He offered to give it a try. I smiled gratefully…"
                }
            },
            {
                "displayText": {
                    "content": "I hope you've enjoyed the story so far. Would you like to hear the next part?"
                }
            }
        ],
        "suggestionsList": [
            {
                "title": "Yes"
            },
            {
                "title": "No"
            }
        ],
        "agentLogoUrl": "https://lh3.googleusercontent.com/HNbbYhdNrGKtHaG_vr93xjprs4RQtVqvaX2xHkmxGhDrxX2LmpTiTmoU3VhGTzHByzXm1m8L3Y1U1w",
        "agentStyle": {
            "primaryColor": "#101010",
            "fontFamily": "",
            "borderRadius": 0,
            "backgroundImageUrl": "https://lh3.googleusercontent.com/3KrCYREWgBxduAGRxWRbZPPXwVVwu3YtA1nBjbiwbJs-e98Ql-tXqw31jxzbKZmt4Jn4bLlrLe4N9Q"
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 8,
            "showSuggestionsPayLoad": {
                "textsList": [
                    "Yes",
                    "No"
                ]
            }
        },
        {
            "operationType": 1,
            "micUpdatePayLoad": {
                "micMode": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "Disney Princess",
    "servingModelOutdated": false,
    "request": "Yes"
}