{
    "response": "Timothy Harrison, of Center Point, Alabama, planned to attend his high school graduation. He’d even cleared it with his boss to take time off. But when the day of the ceremony dawned, Timothy found himself stranded. The ceremony was set to be held over an hour away and Timothy had no way of getting there. Having missed picking up his ticket, cap, and gown and unable to reach the ceremony, Timothy had accepted his fate. That fate would be changed when his boss at the Waffle House Timothy works at, Cedric Hampton, became aware of Timothy's situation. Together with employees and even a few customers, Cedric got the Waffle House team to work. Together they managed to get Timothy to his graduation in full attire and ticket in hand. No one should miss their high school graduation and, because of this community, Timothy didn't have to either. This has been your daily dose of good vibes! Come back daily to hear your daily dose of goodness. Have a wonderful day!",
    "expectUserResponse": false,
    "conversationToken": "EosDS2o5ek...",
    "audioResponse": "//NExAASWA...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": " Timothy Harrison, of Center Point, Alabama, planned to attend his high school graduation. He’d even cleared it with his boss to take time off. But when the day of the ceremony dawned, Timothy found himself stranded. The ceremony was set to be held over an hour away and Timothy had no way of getting there. Having missed picking up his ticket, cap, and gown and unable to reach the ceremony, Timothy had accepted his fate. That fate would be changed when his boss at the Waffle House Timothy works at, Cedric Hampton, became aware of Timothy's situation. Together with employees and even a few customers, Cedric got the Waffle House team…"
                }
            }
        ],
        "suggestionsList": [],
        "agentLogoUrl": "https://lh3.googleusercontent.com/-d_1PptZ76aJuAI4D6yYiyoCMpdKomTcvtIQsu1D95KBYt63JnjewvtLMxsyBmIhYUAWg3vRIxI",
        "agentStyle": {
            "primaryColor": "",
            "fontFamily": "",
            "borderRadius": 0
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 7,
            "exitIndicatorPayLoad": {
                "status": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "glass half full",
    "servingModelOutdated": false,
    "request": "your daily dose of good news"
}