{
    "response": "OK. Let's get My Morning Prayer.Let's pray My Morning Prayer together.\nDear Lord, I thank You for this day. I thank You for giving me the opportunity to see and hear Your Creation this morning. Help me to start this day with a new attitude and plenty of gratitude. Let me make the best of each and every hour to clear my mind so that I can hear from You. Please broaden my mind so I can accept all things.\nYou have done so much for me and You keep on blessing me. I am truly blessed with God’s LOVE! I'm blessed because You are a forgiving God and an understanding God. I ask now for Your forgiveness. Forgive me this day for everything I have done, or may do, say or think that is not pleasing to You. Please keep Your hands on my shoulders to guide me through this day and keep me safe from all danger and harm. Let me not whine and whimper over things I have no control over. And give the best response when I'm pushed beyond my limits.\nGod I love you and I need you. I know that when I can't pray, You listen to my heart. Come into my heart, please! I ask that the Holy Spirit fill my heart with Your love. Father, I want to embrace You with my arms and feel the warmth of Your strong and loving arms around me.\nContinue to use me to do Your will. Continue to bless me that I may be a blessing to others. Keep me strong that I may help the weak. Keep me uplifted that I may have words of encouragement for others. Remind me to say “Thank You”, “I Love You” and “I’m Sorry” as each opportunity arises.\nI pray for those that are lost and can't find their way. I pray for those that are misjudged and misunderstood. I pray for those who don't know You intimately. I pray for those that don't believe.\nI believe that God changes people and God changes things. I pray for all my sisters and brothers. For each and every family member in their households. I pray for peace, love and joy in their homes that all their needs are met. I pray that every eye can see there is no problem, circumstance, or situation greater than God. Every battle is in Your hands for You to fight.\nI pray that I will continue to receive Your love in my heart and to share this love with every one that I encounter today.\nIn Jesus precious name. Amen!\nHave a wonderful day!",
    "expectUserResponse": false,
    "conversationToken": "EosDS2o5ek...",
    "audioResponse": "//NExAARgD...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "OK. Let's get My Morning Prayer."
                }
            },
            {
                "displayText": {
                    "content": "Let's pray My Morning Prayer together.\n\nDear Lord, I thank You for this day. I thank You for giving me the opportunity to see and hear Your Creation this morning. Help me to start this day with a new attitude and plenty of gratitude. Let me make the best of each and every hour to clear my mind so that I can hear from You. Please broaden my mind so I can accept all things.\n\nYou have done so much for me and You keep on blessing me. I am truly blessed with God’s LOVE! I'm blessed because You are a forgiving God and an understanding God. I ask now for Your forgiveness. Forgive me this day for everything I have done, or may do, say or…"
                }
            }
        ],
        "suggestionsList": [],
        "agentLogoUrl": "https://lh3.googleusercontent.com/t3NAiaLKXG0-YVvAmeg5xU38GqoGt57l5Ptv03dBIHkpCdotJOBRTvzv2JcLOo4eVyDZ0ZXUrpX0",
        "agentStyle": {
            "primaryColor": "",
            "fontFamily": "",
            "borderRadius": 0
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 4,
            "startIndicatorPayLoad": {
                "status": 1
            }
        },
        {
            "operationType": 7,
            "exitIndicatorPayLoad": {
                "status": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "My Morning Prayer",
    "servingModelOutdated": false,
    "request": "Ask My Morning Prayer"
}