{
    "response": "Dark black chocolate is a form of chocolate containing cocoa solids, cocoa butter and sugar, without the milk found in milk chocolate. Government and industry standards of what products may be labeled \"dark chocolate\" vary by country and market.",
    "expectUserResponse": true,
    "conversationToken": "ErQES201Uk...",
    "audioResponse": "//NExAASIH...",
    "ssmlMarkList": [],
    "debugInfo": {
        "sharedDebugInfoList": [],
        "conversationBuilderExecutionEventsList": []
    },
    "conversationBuilderDebugInfo": {
        "eventList": []
    },
    "visualResponse": {
        "visualElementsList": [
            {
                "displayText": {
                    "content": "Dark black chocolate is a form of chocolate containing cocoa solids, cocoa butter and sugar, without the milk found in milk chocolate. Government and industry standards of what products may be labeled \"dark chocolate\" vary by country and market."
                }
            },
            {
                "basicCard": {
                    "title": "Dark Chocolates",
                    "subtitle": "Health Benefits",
                    "formattedText": "Dark chocolate is loaded with nutrients that can positively affect your health.\n\nMade from the seed of the cocoa tree, it is one of the best sources of antioxidants on the planet.\n\nStudies show that dark chocolate (not the sugary crap) can improve your health and lower the risk of heart disease.\n\n Cocoa is rich in plant chemicals called flavanols that may help to protect the heart. Dark chocolate contains up to 2-3 times more flavanol-rich cocoa solids than milk chocolate. Flavanols have been shown to support the production of nitric oxide (NO) in the endolethium (the inner cell lining of blood vessels) that helps to relax the blood vessels and improve blood flow, thereby lowering blood pressure. [1,2] Flavanols in chocolate can increase insulin sensitivity in short term studies; in the long run this could reduce risk of diabetes. [3,4]\n\nObservational studies support the benefits of cocoa flavanols. The link between blood pressure and high cocoa intake was described in a study of the Kuna Indians, an isolated tribe who live on the Caribbean Coast of Panama. [5] Hypertension was extremely uncommon in this group, even among older ages, and even with a dietary salt intake that is greater than most Western populations. When the Kuna migrated to urban environments and changed their diets, their rates of high blood pressure increased. Notably, their traditional intake of cocoa as a beverage was very high, at more than five cups daily of either home-grown or Columbian cocoa powder rich in flavanols. The urinary levels of flavanols in the island-dwelling Kuna were significantly higher and their rates of death from heart disease, cancer, and diabetes significantly lower than their counterparts living in urban centers.\n\nRaspberries, blueberries, dark chocolate, pecans, and almondsOther observational studies suggest a link between high cocoa or chocolate intake of 6 grams daily (1-2 small squares) and a reduced risk of heart disease and mortality, possibly in part by reducing blood pressure and inflammation. [6,7]\n\nDark chocolate is high in calories (150-170 calories per ounce) and can contribute to weight gain if eaten in excess. However, chocolate, like nuts can induce satiety, so the longer term implications for weight control are not clear.  It also contains a moderate amount of saturated fat, which can negatively affect blood lipid levels, though its heart-protective effects from flavanols appear to outweigh the risk. Choosing dark chocolate and eating modest quantities may offer the greatest health benefits.",
                    "image": {
                        "url": "https://i0.wp.com/cdn-prod.medicalnewstoday.com/content/images/articles/321/321618/dark-chocolate-and-cocoa-beans-on-a-table.jpg?w=1155&h=1541",
                        "accessibilityText": "Dark Chocolates",
                        "height": 0,
                        "width": 0
                    },
                    "buttonsList": [],
                    "imageDisplayOptions": 0
                }
            }
        ],
        "suggestionsList": [
            {
                "title": "White Chocolates"
            },
            {
                "title": "Exit"
            }
        ],
        "agentLogoUrl": "https://lh3.googleusercontent.com/b7-1K2ASZf27CovsHdhCCzSKvcCsfXE3ZPljwkXtiQfaHg-xOYpUnZc7P_MaRyItZCtSxdZ9KOacPg",
        "agentStyle": {
            "primaryColor": "",
            "fontFamily": "",
            "borderRadius": 0
        }
    },
    "clientError": 0,
    "is3pResponse": true,
    "clientOperationList": [
        {
            "operationType": 8,
            "showSuggestionsPayLoad": {
                "textsList": [
                    "White Chocolates",
                    "Exit"
                ]
            }
        },
        {
            "operationType": 1,
            "micUpdatePayLoad": {
                "micMode": 1
            }
        }
    ],
    "projectName": "",
    "renderedHtml": "",
    "previewStartTimeMicros": "",
    "isEmptyResponse": false,
    "agentName": "Choco Lover Fun Trivia",
    "servingModelOutdated": false,
    "request": "Dark Chocolates"
}